EmbeddedSystemClass/STM32_DOL_2_CHANNEL/freertos_test/main.c

#include "stm32f4xx.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_tim.h"


#include <misc.h>
#include "system_stm32f4xx.h"

#include <stdio.h>
#include <math.h>

//FreeRTOS:

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"
#include "proto.h"
#include "watchdog.h"

//#include "power_detector.h"
#include "encoder.h"


//
//static void Init_Task(void *pvParameters);//
//
//static void Init_Task(void *pvParameters)
//{
//
//	//Power_Detector_Init();
//	//vTaskDelay(200);
//	Watchdog_Init();
//	Encoder_Init();
//	Proto_Init(PROTO_FIRST_INIT);
//    vTaskDelete( NULL );
//}

int main(void)
{
	SystemInit();

	//Watchdog_Init();

	Encoder_Init();
	Proto_Init(PROTO_FIRST_INIT);

 //   xTaskCreate(Init_Task,(signed char*)"INIT",128,NULL, tskIDLE_PRIORITY + 1, NULL);

    vTaskStartScheduler();

    while(1);
}
//---------------------------------------------------------------------------------------

void vApplicationTickHook( void )
{
	portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
}
/*-----------------------------------------------------------*/

void vApplicationMallocFailedHook( void )
{
	for( ;; );
}
/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( xTaskHandle pxTask, signed char *pcTaskName )
{
	( void ) pcTaskName;
	( void ) pxTask;
	for( ;; );
}
/*-----------------------------------------------------------*/

void vApplicationIdleHook( void )
{
volatile size_t xFreeStackSpace;

	xFreeStackSpace = xPortGetFreeHeapSize();

	if( xFreeStackSpace > 100 )
	{
	}
}
